Repository: elusiveunit/lucid-email-encoder
Catalog: lang/leejl-*.po
Languages: sv_se

source: Settings
sv_se: Inställningar

source: Generate manual encoding
sv_se: Generera manuell kodning

source: For more information:
sv_se: För mer information:

source: The JavaScript option encodes entire mailto links, in addition to regular email addresses.
sv_se: JavaScript-valet kodar, förutom vanliga e-postadresser, även om hela mailto-länkar.

source: Encode random parts to HTML entities
sv_se: Koda om slumpmässiga delar till HTML entities

source: Encode with JavaScript
sv_se: Koda om till JavaScript

source: Message for JavaScript
sv_se: Meddelande för JavaScript

source: Generate
sv_se: Generera

source: Unknown error
sv_se: Okänt fel

source: Lucid Toolbox couldn't be activated, error message: %s
sv_se: Lucid Toolbox kunde inte aktiveras, felmeddelande: %s

source: Lucid Toolbox was activated successfully!
sv_se: Lucid Toolbox aktiverades utan problem!

source: Lucid Toolbox is needed for Lucid Email Encoder to function properly.
sv_se: Lucid Toolbox krävs för att Lucid Email Encoder ska fungera korrekt.

source: Output JavaScript and CSS for the message
sv_se: Använd JavaScript och CSS för meddelandet

source: Handle JavaScript message
sv_se: Hantera JavaScript-meddelande

source: If the address is displayed in a place not filtered by Lucid Email Encoder, or if you want to include surrounding HTML, you can generate the necessary script here.
sv_se: Om adressen visas på ett ställe som inte filtreras av Lucid Email Encoder, eller om du vill inkludera omkringliggande HTML, kan du generera skript här.

source: Automatic filtering
sv_se: Automatisk filtrering

source: If a message is set, it will be added before the email addresses if the JavaScript protection is selected. This requires handling in the theme's CSS or the option below, to show and hide when appropriate. The message is wrapped in <code>&lt;span class="email-hidden-message"&gt;</code>
sv_se: Om ett meddelande anges kommer det läggas till innan e-postadresser, förutsatt att JavaScript-skyddet är valt. Detta kräver hantering i temats CSS, eller inställningen under, för att visa och dölja vid behov. Meddelandet omsluts av <code>&lt;span class="email-hidden-message"&gt;</code>

source: <strong>Will not work if there is a js-like class already</strong> (like some-js, js-here). A more robust way would be to add the class 'no-js' to the html element, add the CSS rule to the theme and use the snippet below in the &lt;head&gt; (preferably high up like below the title):
sv_se: <strong>Kommer inte fungera om det finns en js-liknande klass redan</strong> (som lite-js, js-here). En mer robust lösning är att lägga till klassen "no-js" på html-elementet, lägga till CSS-regeln i temat och använda kodsnutten nedan i &lt;head&gt; (helst långt upp som under title):

source: A third option, which is also very useful for theme development, is to use <a href="%s" target="_blank">Modernizr</a>.
sv_se: Ett tredje alternativ, som även är väldigt användbart för tema-utveckling, är att använda <a href="%s" target="_blank">Modernizr</a>.

source: Email protection
sv_se: E-postskydd

source: Read more about the options in the help tab on this page.
sv_se: Läs mer om inställningarna i hjälp-fliken på denna sida.

# Automatic filtering
source: None
sv_se: Ingen

source: Wrapped in &lt;span class="email-hidden-message"&gt;
sv_se: Omsluts av &lt;span class="email-hidden-message"&gt;

source: Manual script tags
sv_se: Manuella skript-taggar

source: Choose if email addresses in certain content blocks should be filtered automatically. The default filters are <code>the_content</code>, <code>the_excerpt</code>, <code>widget_text</code>, <code>comment_text</code> and <code>comment_excerpt</code>. If disabled, the JavaScript decoding functions will still be available for manual use with the script generator.
sv_se: Välj om e-postadresser i vissa innehållsblock ska filtreras automatiskt. Standardfilter är <code>the_content</code>, <code>the_excerpt</code>, <code>widget_text</code>, <code>comment_text</code> och <code>comment_excerpt</code>. Om det inaktiveras kommer avkodningsfunktionerna i JavaScript ändå vara tillgängliga för manuell användning med skriptgeneratorn.

source: If activated, a .js class will be added to the html element (as long as none is found) and a CSS rule will be inserted:
sv_se: Om det aktiveras kommer en .js-klass läggas till på html-elementet (förutsatt att ingen hittas) och en CSS-regel kommer läggas till:

source: Lucid Email Encoder on Github
sv_se: Lucid Email Encoder på Github
